src/Openfoam/AeroSUV_rearWheels_case/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version: 2312                                   |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}

// ************************************************************************* //

surfaces
{
        rearWheels
        {
            extractionMethod    extractFromSurface;

            extractFromSurfaceCoeffs
            {
                file            "Geometry/17_wheels-front_scaled.stl";
                extractAngle   150;
            }

            writeObjFeatures    yes;
        }
}

